//=============================================================================
// < SoundTestプログラム >
// サウンドエフェクト番号表 [soundEffect.cpp]
// Author : 蔡 友剛
//
//=============================================================================
#ifndef _SOUNDEFFECT_
#define _SOUNDEFFECT_

//=============================================================================
// マクロ定義
//=============================================================================
// エフェクト情報
#define EFFECT_MAX						(10)

//=============================================================================
// 定数定義
//=============================================================================
enum
{	// エフェクト用フラグ
	NULL_SOUND_EFFECT,
	WATER_SOUND_EFFECT,
	CHORUS_SOUND_EFFECT,
	FLANGER_SOUND_EFFECT,
	ECHO_SOUND_EFFECT,
	DISTORTION_SOUND_EFFECT,
	COMPRESSOR_SOUND_EFFECT,
	PARAMEQ_SOUND_EFFECT,
	I3DL2REVERB_SOUND_EFFECT,
	WAVES_REVERB_SOUND_EFFECT
};

//=============================================================================
// プロトタイプ宣言
//=============================================================================
GUID GetSoundEffectID(int no);		// enumの定義を参照してIDを戻す関数

#endif 
