//=============================================================================
//
// 波の背景処理 [waveBackground.h]
// Author : 蔡 友剛
//
//=============================================================================
#ifndef _WAVE_BACKGROUND_H_
#define _WAVE_BACKGROUND_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 背景								   
#define	TEXTURE_WAVE_BACKGROUND			_T("data/TEXTURE/blueTheme.jpg")		// 読み込むテクスチャファイル名



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWaveBackground(int InitType);	// 初期化処理
void UninitWaveBackground(void);				// 終了処理
void UpdateWaveBackground(void);				// 更新処理
void DrawWaveBackground(void);				// 描画処理

#endif